{
  "name": "The OldOS Project",
  "subtitle": "Recreating a fully functional version of iOS 4 in SwiftUI.",
  "description": "",
  "iconURL": "https://i.imgur.com/BmbDuKW.png",
  "website": "https://github.com/zzanehip/The-OldOS-Project",
  "patreonURL": "",
  "tintColor": "#3c3539",
  "featuredApps": [
    "com.zurac.OldOSSL2"
  ],
  "headerURL": "https://github.com/zzanehip/The-OldOS-Project/raw/master/Images/Header.jpg",
  "apps": [
    {
      "name": "OldOS",
      "bundleIdentifier": "com.zurac.OldOSSL2",
      "marketplaceID": "",
      "developerName": "@zzanehip (Zane)",
      "subtitle": "Recreating a fully functional version of iOS 4 in SwiftUI.",
      "localizedDescription": "OldOS is a testament to the days of yesteryear, showcasing what iOS once was ten years ago. The ethos of the app is to merge the technologies of today with a pixel-perfect recreation of the user experience of the past. The vast majority of apps in OldOS are fully functional — meaning they seamlessly integrate with the data on your phone to deliver a live, emulator-esque experience. What does this mean? Well, you can play your music in iPod, get directions in Maps, surf the web in Safari, view the current weather in Weather, and much more. By the same token, no shortcuts were taken in fully fleshing out the operating system. You can change your background, adjust settings, search apps, et cetera. There are a few apps still not ready for primetime but don't worry, they're coming soon.\n\nWith OldOS, you no longer need to worry about securing a legacy iPhone to experience nostalgia — it's available on your daily driver.\n\nPart of the goal with OldOS is to enable anyone to understand how iOS works and demonstrate just how powerful SwiftUI truly is. For that reason, the entire app is open-sourced — enabling developers to learn about, modify, and add to the app. I thought building this over my last six or so months in high school and sharing it with the world would be a fun and productive endeavor.",
      "iconURL": "https://i.imgur.com/BmbDuKW.png",
      "tintColor": "#3c3539",
      "category": "entertainment",
      "screenshots": [
        "https://i.imgur.com/bUB23Az.png",
        "https://i.imgur.com/Ed7Ihan.png",
        "https://i.imgur.com/nJRPXfc.png",
        "https://i.imgur.com/r7ZZq3t.png",
        "https://i.imgur.com/uEuwoKA.png"
      ],
      "versions": [
        {
          "downloadURL": "https://github.com/zzanehip/The-OldOS-Project/releases/download/2.0_1/OldOS.ipa",
          "size": 108500000,
          "version": "2.0",
          "buildVersion": "1",
          "date": "2025-07-08T21:20:00-04:00",
          "localizedDescription": "Where to begin. This update, and my goal with it, is to bring the project back from the dead so to speak. In doing so, the codebase has been retooled and refactored, APIs have been restored, and compilation errors have been resolved. In the same vein, all (or maybe most?) bugs related to changes in iOS/Swift/SwiftUI over the past few years have been resolved. My goal is to put a new foundation in place to begin building on top of again. In other words, 2.0 returns OldOS to how it once was (and improves it perhaps too).",
          "minOSVersion": null
        }
      ],
      "appPermissions": {
        "entitlements": [],
        "privacy": {
          "NSAppleMusicUsageDescription": "To view, play, and experience your music in OldOS, please enable access to your music library. ",
          "NSCameraUsageDescription": "To take photos in OldOS, please enable access to your camera.",
          "NSContactsUsageDescription": "To view and manage your contacts in OldOS, please enable access to your contacts list.",
          "NSLocationAlwaysAndWhenInUseUsageDescription": "To enable maps to work properly, and see your current wifi network in Settings, please enable access to your location. Then close and re-open the Maps app.",
          "NSLocationAlwaysUsageDescription": "To enable maps to work properly, and see your current wifi network in Settings, please enable access to your location. Then close and re-open the Maps app.",
          "NSLocationWhenInUseUsageDescription": "To enable maps to work properly, and see your current wifi network in Settings, please enable access to your location. Then close and re-open the Maps app.",
          "NSMicrophoneUsageDescription": "To record your audio while filming a video in OldOS, please in enable microphone access.",
          "NSPhotoLibraryAddUsageDescription": "To view, manage, and add photos to your photo library in OldOS, please enable access. Then close and re-open the Photos app.",
          "NSPhotoLibraryUsageDescription": "To view, manage, and add photos to your photo library in OldOS, please enable access. Then close and re-open the Photos app."
        }
      },
      "patreon": {}
    }
  ],
  "news": []
}